#  while більше нагадує:  «Поки ця умова виконується — працюй».

counter = 1

while counter <= 3:
    print(counter)
    counter += 1

print("Готово")


for number in [4, 7, -2, 9]:
    # Беремо числа по черзі: 4, 7, -2, 9

    if number < 0:
        # Якщо число від'ємне
        print("Знайдено від'ємне число")
        break
        # break повністю зупиняє цикл

    print("Перевірено:", number)
    # Цей рядок виконується, якщо число не від'ємне  
    # 4 → перевіряємо → продовжуємо
    #7 → перевіряємо → продовжуємо
    #-2 → від'ємне → break → СТОП
    # 9 → вже не перевіряється



    for number in range(1, 11):
    # Перевіряємо числа від 1 до 10

    if number == 5:
        # Якщо знайшли 5
        break
        # Зупиняємо цикл

    print(number)  #1 2 3 4      5 вже не виводиться, тому що при number == 5 спрацював break.




    total = 0
# Початкова сума дорівнює 0

for number in [5, -3, 8, -1]:
    # Беремо числа по одному

    if number < 0:
        # Якщо число від'ємне
        continue
        # Пропускаємо це число і переходимо до наступного

    total += number
    # Додаємо тільки додатні числа

print(total)
# Виводимо результат   #  5 + 8 = 13

#      5   → додамо → total = 5
#     -3  → continue → НЕ додаємо
#      8   → додамо → total = 13
#     -1  → continue → НЕ додаємо




target = 7

for number in [2, 4, 6, 8]:
    if number == target:       # Перевіряємо: number дорівнює 7?
        print("Знайдено")
        break                  # Якщо знайшли — зупиняємо цикл
else:
    print("Не знайдено")       # Виконується, якщо break НЕ спрацював



target = 6

for number in [2, 4, 6, 8]:
    if number == target:       # Чи number дорівнює 6?
        print("Знайдено")
        break                  # Знайшли → зупиняємо for
else:
    print("Не знайдено")       # Не виконається, бо був break


 # pass   
 age = 20

if age < 18:
    pass                 # Тут поки нічого не робимо
else:

  print("Повнолітній")  

# while True: «Повторюй безкінечно...»
#while True + break — сума      Якщо ввели 0  Зупиняємо цикл

total = 0                         # Початкова сума

while True:                       # Повторюємо без заданого кінця
    number = int(input("Число, 0 — завершити: "))

    if number == 0:               # Якщо ввели 0
        break                     # Зупиняємо цикл

    total += number               # Додаємо число до суми

print("Сума:", total)             # Виводимо результат