print("Студент першого курсу")
print("Курс: Основи програмування мовою Python")
print("Моя ціль: розуміти код, який запускаю")
print("Моя мета: вивчити мову Python та створювати власні програми")

print("A")
print("B!")
print('C')

# 1. Які символи з коду не з’являться у виводі? - Символи, які не виконуються або є частиною коментарів
# 2. Чому Print("A") не є тим самим, що print("A")? -Python чутливий до регістру: Print і print — різні назви
# 3. Що треба перевірити, якщо після редагування видно старий результат?-Чи збережено файл і чи запускається правильний код
# 4. Чому прогноз до запуску корисніший за багато бездумних запусків?-розвиває логічне мислення та допомагає зрозуміти код